# Выведите в консоль таблицу умножения от 2х2 до 9х10 как на школьной тетрадке.

# Вложенный цикл для прохода по всем числам от 2 до 9
for i in range(2, 10):
    # Второй вложенный цикл для прохода по всем числам от 2 до 10
    for j in range(2, 11):
        # Вычисляем произведение i и j
        result = i * j
        # Если результат меньше 10, то выводим с дополнительным пробелом после =
        if result < 10:
            print(j, "x", i, "=", '', result, end=" | ")
        # Иначе выводим результат без дополнительного пробела
        else:
            print(j, "x", i, "=", result, end=" | ")
        # Переходим на следующую строку после прохода по всем столбцам
    print()


# 2 x 2 =  4 | 3 x 2 =  6 | 4 x 2 =  8 | 5 x 2 = 10 | 6 x 2 = 12 | 7 x 2 = 14 | 8 x 2 = 16 | 9 x 2 = 18 | 10 x 2 = 20 |
# 2 x 3 =  6 | 3 x 3 =  9 | 4 x 3 = 12 | 5 x 3 = 15 | 6 x 3 = 18 | 7 x 3 = 21 | 8 x 3 = 24 | 9 x 3 = 27 | 10 x 3 = 30 |
# 2 x 4 =  8 | 3 x 4 = 12 | 4 x 4 = 16 | 5 x 4 = 20 | 6 x 4 = 24 | 7 x 4 = 28 | 8 x 4 = 32 | 9 x 4 = 36 | 10 x 4 = 40 |
# 2 x 5 = 10 | 3 x 5 = 15 | 4 x 5 = 20 | 5 x 5 = 25 | 6 x 5 = 30 | 7 x 5 = 35 | 8 x 5 = 40 | 9 x 5 = 45 | 10 x 5 = 50 |
# 2 x 6 = 12 | 3 x 6 = 18 | 4 x 6 = 24 | 5 x 6 = 30 | 6 x 6 = 36 | 7 x 6 = 42 | 8 x 6 = 48 | 9 x 6 = 54 | 10 x 6 = 60 |
# 2 x 7 = 14 | 3 x 7 = 21 | 4 x 7 = 28 | 5 x 7 = 35 | 6 x 7 = 42 | 7 x 7 = 49 | 8 x 7 = 56 | 9 x 7 = 63 | 10 x 7 = 70 |
# 2 x 8 = 16 | 3 x 8 = 24 | 4 x 8 = 32 | 5 x 8 = 40 | 6 x 8 = 48 | 7 x 8 = 56 | 8 x 8 = 64 | 9 x 8 = 72 | 10 x 8 = 80 |
# 2 x 9 = 18 | 3 x 9 = 27 | 4 x 9 = 36 | 5 x 9 = 45 | 6 x 9 = 54 | 7 x 9 = 63 | 8 x 9 = 72 | 9 x 9 = 81 | 10 x 9 = 90 |
